---
kind: method
id: M:Autodesk.Revit.DB.SchedulableField.#ctor
source: html/234c4757-e3b9-e286-f243-e39ef60f418f.htm
---
# Autodesk.Revit.DB.SchedulableField.#ctor Method

Creates a new SchedulableField.

## Syntax (C#)
```csharp
public SchedulableField()
```